Repository: biblibre/omeka-plugin-SolrSearch
Catalog: languages/*.po
Languages: fr

source: Solr Search
fr: Recherche Solr

source: Omeka Categories
fr: Catégories Omeka

source: Tag
fr: Étiquette

source: Result Type
fr: Type de résultat

source: Solr connection is valid.
fr: La connection Solr est valide.

source: Solr connection is invalid.
fr: La connection Solr est invalide.

source: Fields successfully updated! Be sure to reindex.
fr: Champs mis à jour avec succès! Assurez-vous de réindexer.

source: Highlighting options successfully saved!
fr: Options de surbrillance enregistrées avec succès!

source: Reindexing started.
fr: Réindexation démarrée

source: Relevance
fr: Pertinence

source: Solr Search | Results Configuration
fr: Recherche Solr | Configuration des résultats

source: Results Configuration
fr: Configuration des résultats

source: Solr Search | Index Items
fr: Recherche Solr | Indexation des contenus

source: Index Items
fr: Indexation des contenus

source: Click the button to (re)index the entire site.
fr: Cliquez sur le bouton pour (ré)indexer tout le site.

source: Server
fr: Serveur

source: Fields
fr: Champs

source: Results
fr: Résultats

source: Solr Search | Server Configuration
fr: Recherche Solr | Configuration du serveur

source: Server Configuration
fr: Configuration du serveur

source: Solr Search | Collection Configuration
fr: Recherche Solr | Configuration des collections

source: Solr Search | Field Configuration
fr: Recherche Solr | Configuration des champs

source: Field Configuration
fr: Configuration des champs

source: Field
fr: Champ

source: Facet Label
fr: Label de la facette

source: Is Indexed?
fr: Est indexé ?

source: Is Facet?
fr: Est une facette ?

source: Is Sort?
fr: Est triable ?

source: Update Search Fields
fr: Mettre à jour les champs de recherche

source: Sort by
fr: Trier par

source: Sort
fr: Tri

source: Search the Collection
fr: Chercher dans la collection

source: Search keywords
fr: Recherche par mots-clés

source: Limit your search
fr: Limiter la recherche

source: Untitled
fr: Sans titre

source: Enable Highlighting
fr: Activer la surbrillance

source: Display snippets with highlighted term matches.
fr: Afficher des extraits avec des mots-clés en surbrillance.

source: Number of Snippets
fr: Nombre d'extraits

source: The maximum number of snippets to display.
fr: Le nombre maximum d'extraits à afficher

source: Must be an integer.
fr: Doit être un entier

source: Snippet Length
fr: Longueur de l'extrait

source: The maximum number of characters to display in a snippet.
fr: Le nombre maximum de caractères à afficher pour chaque extrait

source: Extent of Document Highlightable
fr: Étendue du document susceptible d'être mis en surbrillance

source: How much of the document can be highlighted, in characters. Occurrences past this point will not be returned in the results highlighting.
fr: Quelle portion du document peut être mis en surbrillance, en nombre de caractères. Passé ce point, les occurrences ne seront pas affichées dans les résultats.

source: Facet Ordering
fr: Tri des facettes

source: The sorting criteria for result facets.
fr: Le critère de tri pour les facettes

source: Facet Count
fr: Nombre de facettes

source: The maximum number of facets to display.
fr: Le nombre maximum de facettes à afficher.

source: Display private items
fr: Afficher les contenus privés

source: Display private items for all user roles with sufficient permission to view them.
fr: Afficher les contenus privés pour tous les rôles utilisateurs avec les permissions suffisantes pour les voir.

source: Save Settings
fr: Enregistrer les paramètres

source: Clear index
fr: Nettoyer l'index

source: Reindex
fr: Réindexer

source: Server Host
fr: Nom d'hôte du serveur

source: The location of the Solr server.
fr: L'emplacement du serveur Solr.

source: Server Port
fr: Port du serveur

source: The port that Solr is listening on.
fr: Le port sur lequel Solr écoute

source: Core URL
fr: URL du coeur

source: The URL of the Solr core to index against.
fr: L'URL du coeur Solr à utiliser.

source: Invalid core URL.
fr: URL du coeur invalide.
